//
//  Constans.swift
//  SwiftUIPractice
//
//  Created by Алан Парастаев on 01.12.2025.
//

import Foundation

/*
 Создаем статичную константу randomImage с рандомным изображенинием. И используем для предварительной загрузки изображения в разрабатываемых экранах(компонентах) - изображение нам нужно что бы нагляднее понимать как будет выглядить экран, а когда будем внедрять компонеты в основной экран заменим рандомное изображение на настоящий API. ➡️ Далее нужно настроить получаемое рандомное изображение в ImageLouderView ➡️
 */
struct Constans {
    static let randomImage = "https://picsum.photos/600/600"
}
